{
  "nodes": [{
    "summary": "Jailed International Monetary Fund (IMF) chief Dominique Strauss-Kahn resigned late on Thursday saying he wants to concentrate now on proving his innocence.",
    "id": 3224,
    "timestamp": "2011-05-19 18:00:23",
    "title": "IMF chief quits, seeks bail",
    "rank": 1
  }, {
    "summary": "With the resignation of Strauss-Kahn's as IMF chief, debate has emerged as who should lead the Fund.\nThe next IMF chief should be from Europe, but emerging countries should also provide successors in the long term, a German finance ministry spokesman said.\nJohn Lipsky, second-in-command at the IMF, whose term expires in August, has taken over Dominique position as IMF chief until the IMF executive board selects a successor to Strauss-Kahn.",
    "id": 1500,
    "timestamp": "2011-05-19 14:43:49",
    "title": "German Chancellor backs European for IMF chief",
    "rank": 2
  }, {
    "summary": "- Politicking steps up to replace IMF's Strauss-Kahn Politicking steps up to replace IMF's Strauss-Kahn The race to succeed Dominique Strauss-Kahn as head of the International Monetary Fund stepped up Tuesday along with pressure on him to resign and avoid undermining the IMF, a key force of global economic stability.\n- European support rising for Lagarde's IMF bid European support rising for Lagarde's IMF bid France's frank, hard-working and chic finance minister, Christine Lagarde, emerged Friday as Europe's likely candidate to lead the International Monetary Fund.",
    "id": 3225,
    "timestamp": "2011-05-21 05:11:15",
    "title": "European support rising for Lagarde's IMF bid",
    "rank": 3
  }, {
    "summary": "Lawyers arguing whether ex-IMF chief Dominique Strauss-Kahn should get out of jail while he awaits trial on attempted rape charges have used two famous examples from different sides of the spectrum to make their case - Roman Polanski and Bernard Madoff.",
    "id": 8476,
    "timestamp": "2011-05-20 19:15:36",
    "title": "Ex-IMF chief gets $1M bail in NYC sex assault case",
    "rank": 4
  }, {
    "summary": "IMF chief Strauss-Kahn quits Washington, May 19 (IANS) The International Monetary Fund (IMF) said in a statement late Wednesday night that its managing director Dominique Strauss-Kahn, accused of trying to rape a New York hotel maid, has resigned.\nStrauss-Kahn, 62, is accused of sexually attacking a maid at the Sofitel New York hotel near Manhattan’s Times Square.\nGeithner, responding to a question Tuesday in New York, said Strauss-Kahn is ‘obviously not in the position to run the IMF’.",
    "id": 468,
    "timestamp": "2011-05-19 08:45:41",
    "title": "News One",
    "rank": 5
  }, {
    "summary": "PRINT SHARE COMMENTS RELATED WIRES : Ex-IMF Chief Granted Bail, Indicted on All Sex Charges May 20, 2011 India May Throw Montek Hat in the Ring for IMF Top Job May 19, 2011 IMF Chief Bail Hearing Today, Victim Testifies May 19, 2011 Strauss Kahn Resigns as IMF Managing Director May 19, 2011 Montek Best Candidate for IMF Top Job: Kaushik Basu May 18, 2011 US Treasury Secy Calls for New Leadership of IMF May 18, 2011 Strauss-Kahn Has No Immunity: IMF May 17, 2011 EU Endorse $110 Billion Bailout for Portugal May 17, 2011 IMF Executive Board Holds Meet Post Kahn's Arrest May 17, 2011 Not Looking...",
    "id": 480,
    "timestamp": "2011-05-20 12:35:33",
    "title": "Acting IMF Chief Regrets Strauss-Kahn Situation",
    "rank": 6
  }, {
    "summary": "| Do you think IMF chief Dominique Strauss-Kahn is being treated fairly by the news media?\nVote here | IMF candidates scramble | Lawyer: Maid didn’t know IMF chief | Europe is moving quickly to protect its traditional claim to the top job at the IMF ahead of the expected departure of current chief Dominique Strauss-Kahn, fending off any demand from developing countries to claim the job for their own.\nSouth Africa’s finance minister, however, said that a new IMF chief should come from a developing nation to reflect the interests of all countries.",
    "id": 3644,
    "timestamp": "2011-05-18 18:50:25",
    "title": "IMF candidates scramble",
    "rank": 7
  }, {
    "summary": "If a New York judge denies bail for Strauss-Kahn or imposes highly restrictive conditions on his freedom, the IMF’s executive board would expect him to resign, two senior IMF officials say.\n(May 17) More on this Story - Resignation statement from the IMF - Pressure mounts on Strauss-Kahn to resign - Dominique Strauss-Kahn on suicide watch - IMF staffers fear their boss is 'finished' View all Items in this Story - More from Post Business - Q&A: Was IMF chief set up?",
    "id": 7814,
    "timestamp": "2011-05-19 16:19:05",
    "title": "<em>Strauss-Kahn&#39;s</em> future as leader of IMF hinges on bail hearing Friday",
    "rank": 8
  }, {
    "summary": "The IMF's executive board released a letter from the French executive Wednesday in which he denied the allegations lodged against him but said that with \"sadness\" he felt he must resign.\nIf a New York judge denies bail for Strauss-Kahn or imposes highly restrictive conditions on his freedom, the IMF's executive board would have expected him to resign, two senior IMF officials said earlier Wednesday.\nThe IMF's statement late Wednesday said the process of choosing a new leader would begin, but in the meantime John Lipsky would remain acting managing director.",
    "id": 3355,
    "timestamp": "2011-05-19 07:40:38",
    "title": "IMF's Strauss-Kahn resigns amid sex charges",
    "rank": 9
  }, {
    "summary": "Dominique Strauss-Kahn has resigned as managing director of the International Monetary Fund (IMF), according to a letter released Wednesday by the IMF's executive board.\nStrauss-Kahn is accused of sexually assaulting a 32-year-old maid in a luxury hotel in New York.\nOn Monday, a judge in New York denied bail for the then-IMF head, arguing there was a risk Strauss-Kahn would flee the country.",
    "id": 9422,
    "timestamp": "2011-05-19 08:15:49",
    "title": "Strauss-Kahn Resigns as IMF Head",
    "rank": 10
  }, {
    "summary": "(ADDITION IMF Head Assault ) (IMF Head Assault ) (France IMF Head Assault ) (France IMF Head Assault ) CLICK FOR MORE PHOTOS - (ADDITION IMF Head Assault) - (IMF Head Assault) - (France IMF Head Assault) - (France IMF Head Assault) - IMF head isolated, on suicide watch at NYC jail - Pressure rises against IMF chief held at NYC jail - In jail on sex charge, IMF head awaits his fate Strauss-Kahn was one of France's most high-profile politicians and a potential candidate for president in next year's elections.",
    "id": 95,
    "timestamp": "2011-05-18 14:15:09",
    "title": "French politician on suicide watch in New York",
    "rank": 11
  }, {
    "summary": "Dominique Strauss-Kahn resigned as head of the International Monetary Fund, the IMF said in a statement dated May 18, as he faces charges of sexual assault and attempted rape.",
    "id": 10390,
    "timestamp": "2011-05-19 07:05:54",
    "title": "IMF head resigns after assault charges",
    "rank": 12
  }, {
    "summary": "BERLIN — Europe is moving quickly to protect its traditional claim to the top job at the IMF ahead of the expected departure of current chief Dominique Strauss-Kahn, resisting a push from developing countries to appoint someone from another region.\nSimilar stories: - Politicking steps up to replace IMF's Strauss-Kahn Politicking steps up to replace IMF's Strauss-Kahn The race to succeed Dominique Strauss-Kahn as head of the International Monetary Fund stepped up Tuesday along with pressure on him to resign and avoid undermining the IMF, a key force of global economic stability.",
    "id": 4391,
    "timestamp": "2011-05-18 16:25:26",
    "title": "Europe moves to protect claim to IMF top job",
    "rank": 13
  }, {
    "summary": "Former IMF chief gets bail, placed under home detention New York, May 20 (IANS) A New York Judge granted bail Thursday for $1 million to former International Monetary Fund (IMF) managing director Dominique Strauss-Kahn charged with sexual assaulting a hotel maid, Xinhua reported.",
    "id": 2261,
    "timestamp": "2011-05-20 01:45:24",
    "title": "Former IMF chief gets bail, placed under home detention",
    "rank": 14
  }, {
    "summary": "Washington: The International Monetary Fund (IMF) chief Dominique Strauss-Kahn is facing growing pressure to quit after US Treasury Secretary Timothy Geithner said Strauss-Kahn was \"not in a position to run\" the international financial institution.",
    "id": 9271,
    "timestamp": "2011-05-18 08:45:30",
    "title": "Strauss-Kahn 'obviously not in a position' to run IMF: US",
    "rank": 15
  }, {
    "summary": "Washington - Dominique Strauss-Kahn, the embattled managing director of International Monetary Fund (IMF), resigned saying he wanted to devote \"all his energy\" to battle the sexual assault charges he faces in New York.\nIf a New York judge denies bail for Strauss-Kahn or imposes highly restrictive conditions on his freedom, the IMF's executive board would have expected him to resign, two senior IMF officials said earlier on Wednesday.",
    "id": 4515,
    "timestamp": "2011-05-19 15:21:01",
    "title": "Division over choice for new IMF chief",
    "rank": 16
  }, {
    "summary": "- Ex-IMF chief gets $1M bail in NYC sex assault case Ex-IMF chief gets $1M bail in NYC sex assault case The court discourse surrounding former International Monetary Fund chief Dominique Strauss-Kahn is less than a week old but has already turned into a case of invoking the infamous.\nNEW YORK -- Lawyers on both sides in the sexual assault case against former International Monetary Fund chief Dominique Strauss-Kahn have taken to invoking famous - and very different - cases as proof they're right.",
    "id": 8473,
    "timestamp": "2011-05-20 13:25:23",
    "title": "Ex-IMF chief gets $1M bail in NYC sex assault case",
    "rank": 17
  }, {
    "summary": "WASHINGTON — A former finance minister for Turkey who had been among the leading candidates to head the International Monetary Fund is removing himself from consideration.\nThe withdrawal of Kemal Dervis enhances the prospects of French Finance Minister Christine Lagarde by eliminating perhaps the leading non-European candidate to head the IMF.\nDervis had been considered a possible successor to Dominique Strauss-Kahn if the IMF wanted a replacement to come from outside the European Union.",
    "id": 1960,
    "timestamp": "2011-05-20 19:10:36",
    "title": "Dervis' withdrawal raises Lagarde's IMF prospects",
    "rank": 18
  }, {
    "summary": "The IMF's executive board released a letter from the French executive Wednesday in which he denied the allegations lodged against him but said that with \"sadness\" he felt he must resign.\nIf a New York judge denies bail for Strauss-Kahn or imposes highly restrictive conditions on his freedom, the IMF's executive board would have expected him to resign, two senior IMF officials said earlier Wednesday.\nThe IMF's statement late Wednesday said the process of choosing a new leader would begin, but in the meantime John Lipsky would remain acting managing director.",
    "id": 5225,
    "timestamp": "2011-05-19 15:20:45",
    "title": "IMF&#39;s <em>Strauss-Kahn</em> resigns amid sex charges",
    "rank": 19
  }, {
    "summary": "The IMF's executive board released a letter from the French executive late Wednesday in which he denied the allegations lodged against him but said that with \"great sadness\" he felt compelled to resign.\nIf a New York judge denies bail for Strauss-Kahn or imposes highly restrictive conditions on his freedom, the IMF's executive board would expect him to resign, two senior IMF officials said Wednesday.",
    "id": 5775,
    "timestamp": "2011-05-19 07:20:37",
    "title": "IMF: Strauss-Kahn's submits his resignation",
    "rank": 20
  }],
  "links": []
}
